LEXICON_RU: dict[str, str] = {
    'start_text': '🌟 Привет! Добро пожаловать в FamilyFinanceBot! 🌟 \n'
                  'Я - твой личный помощник по управлению семейным бюджетом. \n'
                  'С моей помощью вы сможете легко контролировать свои доходы, '
                  'расходы, финансовые цели, а также разделять семейные расходы с участниками семьи. \n\n '
                  '📊 Функции бота: \n'
                  '✔️Учет доходов и расходов\n'
                  '✔️Планирование бюджета\n'
                  '✔️Отслеживание финансовых целей\n'
                  '✔️Разделение совместных расходов',
    'setting_category': '👨📊 Пора настроить категории! 📊 \n'
                        'Чтобы упростить учет ваших расходов и доходов, '
                        'предлагаю создать категории, которые будут отображать '
                        'вашу финансовую активность более ярко и понятно. '
                        'Это поможет вам более детально видеть, куда уходят ваши деньги, '
                        'и отслеживать источники вашего дохода. 📈💰💡\n'
                        'С чего начнем?',

    'add_expenses_cat': '📊 Введите название категорий расходов и '
                        'планируемые суммы расходов в месяц в следующем формате: \n\n'
                        '🧺Продукты - 20000 \n'
                        '👗Одежда - 3000 \n'
                        '🙈Развлечения \n\n'
                        'P.S. Вы всегда сможете изменить название категории и плановые суммы расходов.',
    'add_income_cat': '📊 Введите название источников доходов '
                        'и ежемесячные суммы доходов в следующем формате: \n\n'
                        '💳Зарплата-50000 \n'
                        '🎂Фриланс-20000 \n\n'
                        'P.S. Вы всегда сможете изменить название источников и плановые суммы доходов.',
    'add_category_ok':'👌🏼Все готово\n\n'
                      '📝 Для записи расходов отправьте сумму, а при желании, укажите категорию, например: \n'
                      '450 продукты\n'
                      '1500 одежда\n\n'
                      'Бот также поддерживает использование знаков плюса (+300 зарплата) и минуса (-300 развлечения)\n'
                      '💬 Вы также можете добавить комментарий к каждому расходу, например: \n'
                      '1500 на продукты - сходил в магазин\n'
                      'Надеюсь, это поможет вам удобно вести учёт ваших финансов!',
    'balance_user': '💰Баланс',
    'report_month_user': '🗓️Отчет за месяц',
    'analysis_user': '📊Анализ',
    'personal_account_user': '👤Личный кабинет',
    'settings_user': '⚙️Настройки',
    'not_match': '❗️Вы ввели не корректные данные😔',

    'date_fin': '📆Дата',
    'change': '🔄 Изменить категорию',
    'comment': '💬Комментарий',
    'cancel_fin': '❌ Отмена',

    'category_user': '⬅️К категориям',
    'expenses_cat': '📉Расходы',
    'income_cat': '📈Доходы',
    'cancel': '🚫Отмена',
    'done': '✅Готово',
    'check_day': '📆Выберите число⬇️',
    'check_month': '📆Выберите месяц⬇️',
    'check_year': '📆Выберите год⬇️',
    'back_date_order': '🔙Назад',
    'edit_sum': '💰Изменить сумму',
    'edit_category': '📃Изменить категорию',
    'back_report': '⏪',
    'forward_report': '⏩',
}
